# IndexTriangle Class

---
A triangle primitive consisting of three indices.
SystemObject Autodesk.Revit.DB.DirectContext3DIndexPrimitive Autodesk.Revit.DB.DirectContext3DIndexTriangle
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class IndexTriangle : IndexPrimitive

    Public Class IndexTriangle
    	Inherits IndexPrimitive

    public ref class IndexTriangle : public IndexPrimitive

    type IndexTriangle =
        class
            inherit IndexPrimitive
        end
The IndexTriangle type exposes the following members.
| Name| Description
---|---|---
| IndexTriangle|  Constructs the triangle primitive.
Top
| Name| Description
---|---|---
| Index0|  The index of the triangle's first vertex.
| Index1|  The index of the triangle's second vertex.
| Index2|  The index of the triangle's third vertex.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from IndexPrimitive)
Top
| Name| Description
---|---|---
| Dispose| (Inherited from IndexPrimitive)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetSizeInShortInts|  Gets the amount of storage that the primitive takes up in a buffer, measured in short integers.
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
Indices of a triangle's vertices can be listed in either the clockwise or counterclockwise winding order, according to the triangle's orientation in space. A DirectContext3D triangle faces the viewer if its vertices are in counterclockwise order from the viewer's point of view.
#### Reference
Autodesk.Revit.DB.DirectContext3D Namespace